exams/1_home/examination/examination.tex
% Created 2021-09-19 Sun 07:14
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{NTNU IDATA 2302}
\date{Week 4}
\title{Take-home Examination 1\\\medskip
\large Optional}
\hypersetup{
 pdfauthor={NTNU IDATA 2302},
 pdftitle={Take-home Examination 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
This home examination \textbf{does not account for your final grade}, but is
an opportunity to practice. Like the final examination will, it
contains four parts, each awarded 25 points (each question worth 5
points). To make the most of it, I suggest you consider the following:
\begin{itemize}
\item During the final examination, you will only have 4 hours to solve
the given problems. You may want to time-box this home examination
as well.
\item During the final examination, you \textbf{are allowed} to use \textbf{any} written
or online material.
\item For this to mirror the conditions of the final examination, you
have to take it individually.
\item I expect answers to be motivated (except when otherwise stated). I
will not give points for results that comes from nowhere.
\item Please turn your solution in \textbf{by Friday, October 1, 2021}, if you
would like me to grade it.
\end{itemize}

These home examinations also help me find how much can be done in four
hours and which topics I fail to convey clearly. Any \textbf{feedback is
welcome}.



\section{Basic Knowledge (25 pts)}
\label{sec:orgf005d70}

\begin{enumerate}
\item Provided that the following RAM assembly program is written from
memory address \texttt{0}. What value is stored at memory address \texttt{2}
once the machine has stopped?
\begin{minted}[linenos,firstnumber=1]{asm}
LOAD 2
ADD  2
ADD  2
STORE 2
HALT
\end{minted}

\item Can a RAM assembly program modify its own instructions? Give an
example.

\item How many \emph{execution paths} result from the following Java
program?
\begin{minted}[]{java}
static int maximum(int a, int b, int c) {
   if (a < b) {
      if (b < c) {
         return c;
      } else {
         return b;
      }
   } else {
     if (a < c) {
        return c;
     } else {
        return a;
     }
   }
}
\end{minted}

\item Why does the insertion in an array have a linear worst case
runtime efficiency?

\item Why does the insertion in a linked list also have a linear runtime
efficiency in the worst case?
\end{enumerate}


\section{Algorithm Analysis (25 pts)}
\label{sec:org1ce7c40}

We look here at the worst case runtime complexity of the insertion
sort. To simplify, we will \textbf{only count comparisons} (\texttt{==}, \texttt{>},
\texttt{<=}, etc.), in the worst case.

The listing below shows an implementation of the "insertion sort" in
Java. Insertion sort builds a sorted array by inserting new elements
at their proper position.

\begin{minted}[linenos,firstnumber=1]{java}
public static void insertionSort(int[] array) {
    for (int current=1 ; current<array.length ; current++) {
        int itemToInsert = array[current];

        // We select where to insert the current item
        int selectedPosition = current;
        for (int position=0 ; position < current ; position++){
            if (array[position] > itemToInsert) {
                selectedPosition = position;
                break;
            }
        }

        // We insert the current element at the selected position
        for (int index=current; index>selectedPosition; index--) {
            array[index] = array[index-1];
        }
        array[selectedPosition] = itemToInsert;
    }
}
\end{minted}

\begin{enumerate}
\item Rewrite the code so that the inner \texttt{for} loops become two separate
functions named \texttt{findInsertionPosition} and \texttt{insert},
respectively. Also expand all three \texttt{for} loops into while loops.

\item Looking at the \texttt{findInsertionPosition} function, what is the
problem size and how many comparisons are needed in the worst
case?

\item Looking at the \texttt{insert} function, what is the problem size and how
many comparisons are needed in the worst case?

\item Looking now at the \texttt{insertionSort} procedure, what is the
problem size and how many comparisons are needed in the worst
case?

\item So what is the worst case for the overall \texttt{insertionSort}? Show
that it has, in the worst case, a quadratic runtime.
\end{enumerate}

\section{Data Structure (25 pt)}
\label{sec:org1ad97de}

In this problem, we look at the \emph{Josephus problem}, which goes as
follows. A group of \(n\) players (numbered from 1 to \(n\)) forms a
circle and a ball is passed from one player to the next, \(k\)
times. The last player that receives the ball is excluded. The
excluded player gives the ball to her successor, the circle then
closes and the game restarts
with ball going through another \(k\)
passes. The last person in the game wins.

\begin{enumerate}
\item In one single run of this game, how many time will we need to
exclude a player? How many time will we need to pass the ball?

\item Which data structure would you choose to simulate a run of this
game: An array or a linked list? How would this help with
deletion and traversal.

\item Outline an algorithm which simulates this process and outputs the
identifier of the wining player.

\item What is the space-efficiency of your solution? Argue \emph{informally}.

\item What is the runtime-efficiency of your solution? Argue
\emph{informally}.
\end{enumerate}


\section{Algorithm Design (25 pt)}
\label{sec:org7c25fb9}

The problem here is to design an algorithm that checks whether a
given algebraic expression has balanced parentheses. In other words,
we detect missing or extra parentheses. If the given expression has
well-balanced parentheses, our algorithm should return \texttt{-1},
otherwise it should output the index of first invalid parenthesis.

\begin{minted}[]{java}
static int checkParentheses(char[] expression) {
   // Your logic goes here
} 
\end{minted}

Consider the four following test cases as examples.
\begin{itemize}
\item Checking \texttt{(a+1)/(2+c)} should return \texttt{-1} because the given input
has balanced parentheses;
\item Checking \texttt{(a+(2-c)*3} should return \texttt{0} because the first
parenthesis is never closed;
\item Checking \texttt{(a+b)*3)+c} should return \texttt{7} because the closing parenthesis
at index 7 has no match
\item Checking \texttt{a+b/c} should return \texttt{-1} because it does not contain
any parenthesis.
\end{itemize}

For the sake of simplicity, we assume the algebraic expression comes
as an array of characters. We also assume that it only contains a
single type of parentheses, namely '(' or ')'.

\begin{enumerate}
\item Outline an algorithm that implements such a check.

\item Explain why your algorithm satisfies the four test cases listed
previously.

\item What is the worst case runtime efficiency of your algorithm?

\item What is the worst case space efficiency of your algorithm?

\item Do you think there is a better solution, regarding runtime and
space? Why?
\end{enumerate}

\noindent\rule{\textwidth}{0.5pt}
\textbf{End of the examination}
\end{document}